# Hyungwon Yang
# 24.04.15.

name: "ensemble_model"
platform: "ensemble"
max_batch_size: 4

input [
  {
    name: "input_text"
    data_type: TYPE_STRING
    dims: [-1]
  }
]
output [
  {
    name: "generated_image"
    data_type: TYPE_FP16
    dims: [-1, -1, -1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "text_translation"
      model_version: -1
      input_map {
        key: "input_prompt"
        value: "input_text"
      }
      output_map {
        key: "translated_prompt"
        value: "translated_text"
      }
    },
    {
      model_name: "image_generation"
      model_version: -1
      input_map {
        key: "input_image_text"
        value: "translated_text"
      }
      output_map {
        key: "output_generated_image"
        value: "generated_image"
      }
    }
  ]
}