# Hyungwon Yang
# 

backend: "python"
max_batch_size: 8

input [
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [1]
  }
]
output [
  {
    name: "generated_image"
    data_type: TYPE_FP16
    dims: [-1, -1, -1]
  }
]

dynamic_batching {
   preferred_batch_size: [ 4 ]
    max_queue_delay_microseconds: 300000
  }


instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]